# config.py

D_COLUMNS = [
    "施設コード", "データ識別番号", "退院年月日", "入院年月日", "データ区分", "順序番号",
    "病院点数マスターコード", "レセ電コード", "解釈番号", "診療行為名称", "行為点数",
    "行為薬剤料", "行為材料料", "円点区分", "行為回数", "保険者番号", "レセプト種別コード",
    "実施年月日", "レセプト科区分", "診療科区分", "医師コード", "病棟コード", "病棟区分",
    "入外区分", "施設タイプ", "算定開始日", "算定終了日", "算定起算日", "分類番号", "医療機関関係数"
]

E_COLUMNS = [
    "施設コード", "データ識別番号", "退院年月日", "入院年月日", "データ区分", "順序番号",
    "病院点数マスターコード", "レセ電コード", "解釈番号", "診療行為名称", "行為点数",
    "行為薬剤料", "行為材料料", "円点区分", "行為回数", "保険者番号", "レセプト種別コード",
    "実施年月日", "レセプト科区分", "診療科区分", "医師コード", "病棟コード", "病棟区分",
    "入外区分", "施設タイプ"
]

F_COLUMNS = [
    "施設コード", "データ識別番号", "退院年月日", "入院年月日", "データ区分", "順序番号",
    "行為明細番号", "病院点数マスターコード", "レセ電コード", "解釈番号", "診療行為名称",
    "使用量", "基準単位", "行為明細点数", "行為明細薬剤料", "行為明細材料料", "円・点区分",
    "出来高実績点数", "行為明細区分情報"
]

CHUO_DEFAULTS = [
    {"部門区分": "中央診療", "部署コード": "3101", "デフォルト部署名": "手術"},
    {"部門区分": "中央診療", "部署コード": "3102", "デフォルト部署名": "麻酔"},
    {"部門区分": "中央診療", "部署コード": "3103", "デフォルト部署名": "検査"},
    {"部門区分": "中央診療", "部署コード": "3104", "デフォルト部署名": "画像診断"},
    {"部門区分": "中央診療", "部署コード": "3105", "デフォルト部署名": "リハビリ"},
    {"部門区分": "中央診療", "部署コード": "3106", "デフォルト部署名": "透析"},
    {"部門区分": "中央診療", "部署コード": "3201", "デフォルト部署名": "材料薬剤"},
    {"部門区分": "中央診療", "部署コード": "3202", "デフォルト部署名": "材料"},
    {"部門区分": "中央診療", "部署コード": "3203", "デフォルト部署名": "薬剤"},
    {"部門区分": "中央診療", "部署コード": "3204", "デフォルト部署名": "栄養"},
]